//Cоздать функцию которая принимает число и возвращает  текст как в примере:
// 3275  —>  "3000 + 200 + 70 +5"
/*
function foo(number) {
    let t = 1
     let arr = []
     let n = 10

    while (number) {
        let b = 0
        b = number % n;
        number -= b
        n *= 10
        arr.unshift(b)
    }

    let str = ''
    for (const arrElement of arr) {
        str += arrElement + ' + '
    }
    str = str.slice(0,   - 3)
    console.log(str);
}
let a = 567834
foo(a)

 */
////////////////////////////////////////////////////////////////////////////////////////////////////
//Дан массив целых чисел, найдите тот, который встречается нечетное количество раз.Всегда будет только одно целое число, которое встречается нечетное количество раз
// [1,2,3,4,5,2,4,1,3] -> 5
/*
let arr = [1,2,3,4,5,2,4,1,3, 9, 8, 3, 8, 8, 8]
function foo(arr = []){
    for(let i = 0; i < arr.length; i++){
        for(let j = 0; j < arr.length; j++){
            if(i === j){
                continue
            }
            else if(arr[i] === arr[j]){
                arr[i] = null
                arr[j] = null
            }
        }
    }
    for (let j = 0; j < arr.length; j++) {
        if(arr[j] !== null){
            console.log(arr[j]);
        }
    }

}
foo(arr)

 */
/////////////////////////////////////////////////////////////////////////////////////////////////////////////
//Знайти анаграму.
// Перевірити чи слово має в собі такі самі літери як і поеперднє слово.
//
// ANAGRAM | MGANRAA -> true
// EXIT | AXET -> false
// GOOD | DOGO -> true
/*
function foo(string_1 = '', string_2 = ''){
    let k = 0
    for(let i = 0; i < string_1.length; i++){
        for(let j = 0; j < string_2.length; j++){
            if(string_1[i] === string_2[j]){
                k++
                break
            }
        }
    }
    let bool = false
    if(k === string_1.length){
        bool = true
    }
    console.log(k);
    console.log(bool);
}
foo('ANAGRAM', 'MGANRAA')
foo('EXIT', 'AXET')
foo('hello', 'helo')

 */
/////////////////////////////////////////////////////////////////////////////////////////
//Точная степень двойки
// Дано натуральное число N.
// Выведите слово YES, если число N является точной степенью двойки, или слово NO в противном случае.
// Операцией возведения в степень пользоваться нельзя!
/*
function foo(num, n = 2){
    if(num === n)
        return 'YES'
    else if(n > num){
        return 'No'
    }
    return foo(num, n*n)
}
let res = foo(16, 2)
console.log(res);

 */
///////////////////////////////////////////////////////////////////////////////////////////////////
/*Сумма цифр числа
Дано натуральное число N. Вычислите сумму его цифр.
При решении этой задачи нельзя использовать строки,
списки, массивы ну и циклы, разумеется.
Рекурсія)*/
/*
function foo(number) {
    let t = 1
     let sum = 0
     let n = 10

    while (number) {
        let b = 0
        b = number % n;
        number -= b
        sum += b / (n / 10)
        n *= 10
    }
    console.log(sum);
}
let a = 123
foo(a)

 */
////////////////////////////////////////////////////////////////////////////////////////////////////////////
//Палиндром
// Дано слово, состоящее только из строчных латинских букв. Проверьте, является ли это слово палиндромом. Выведите YES или NO.
// При решении этой задачи нельзя пользоваться циклами, в решениях на питоне нельзя использовать срезы с шагом, отличным от 1.
/*????????????????????????????????????????????????????????????????????????????????
function foo(string = '', i = 0){
    if(string[i] !== string[string.length-i-1]){
        return 'No'
    } else if (string[i] === string[string.length - i-1]) {
        if (i === length - i - 1)
            return 'Yes'
    }
    return foo(string, i++)
}
let res = foo('mam', 0)
console.log(res);
?????????????????????????????????????????????????????????????????????????????????????????????????
 */
//Количество единиц
// Дана последовательность натуральных чисел  в строке, завершающаяся двумя числами 0 подряд. Определите, сколько раз в этой последовательности встречается число 1. Числа, идущие после двух нулей, необходимо игнорировать.
//
// 2176491947586100 -> 3
/*
let str = '21764191947586100111'
function foo(str = ''){
    let k = 0
    for(let i = 0; i <str.length;i++){
        if(str[i] === '0' && str[i+1] === '0'){
            return k
        }
        else if(str[i] === '1'){
            k++
        }
    }
    return k
}
let res  = foo(str)
console.log(res);

 */
//////////////////////////////////////////////////////////////////////////////////////////////


