//Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
/*
let a = ['a', 'b', 'c']
for (let i = 0; i < 4; i++){
    if(i === 1 || i === 2 || i === 3){
        a.push(i);
    }
}
console.log(a);

 */
/////////////////////////////////////////////////////////////////////////////////////////////

//Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].
/*
let a = [1, 2, 3]
a = a.reverse();
console.log(a);

 */

/////////////////////////////////////////////////////////////////////////////////////////////////////////

//- Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
/*
let a= [1, 2, 3]
a.push(4)
a.push(5)
a.push(6)
console.log(a);

 */
///////////////////////////////////////////////////////////////////////////////////////////////////

//- Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
/*
let a= [1, 2, 3]
a.unshift(4)
a.unshift(5)
a.unshift(6)
console.log(a);

 */
///////////////////////////////////////////////////////////////////////////////////////////////////////////

//- Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
/*
let a = ['js', 'css', 'jq']
let b = a.shift()
document.write(b)

 */
////////////////////////////////////////////////////////////////////////////////////////////////////////////

//- Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
/*
let a = ['js', 'css', 'jq']
let b = a.pop()
document.write(b)

 */
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//- Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [4, 5].
/*
let a = [1, 2, 3, 4, 5]
a.shift()
a.shift()
a.shift()
console.log(a)

 */

////////////////////////////////////////////////////////////////////////////////////////////

//- Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [1,2].
/*
let a = [1, 2, 3, 4, 5]
a.pop()
a.pop()
a.pop()
console.log(a)

 */
//////////////////////////////////////////////////////////////////////////////////////////////////////////

//Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
/*
let a = [1, 2, 3, 4, 5]
a.splice(3, 0, 'a', 'b', 'c')
console.log(a);

 */

/////////////////////////////////////////////////////////////////////

//Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
/*
let a = [1, 2, 3, 4, 5]
a.splice(1, 0, 'a', 'b')
a.splice(6, 0, 'c')
a.push('e')
console.log(a);

 */
////////////////////////////////////////////////////////////////////////////////////////////////

 //Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
/*
let a = [23, 54, 2, 13, 90, 43, 55, 89, 66, 10]
for(let i  = 0; i < a.length; i++){
    if(a[i] % 2 === 0){
        console.log(a[i]);
    }
}

 */

////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//- Взяти масив з 10 чисел або створити його. Створити 2й порожній масив.
// За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
/*
let a = [23, 54, 2, 13, 90, 43, 55, 89, 66, 10]
let b = []
for (let i = 0; i< a.length; i++){
    b.push(a[i]);
}
console.log(b);

 */

///////////////////////////////////////////////////////////////////////////////////////////////////////

//- Взяти масив з 10 чисел або створити його. Створити 2й порожній масив.
// За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
/*
let a = [23, 54, 2, 13, 90, 43, 55, 89, 66, 10]
let b = []
let count = 0;
while(count < a.length){
    b.push(a[count])
    count++;
}

console.log(b);

 */

////////////////////////////////////////////////////////////////////////////////////////////////

//зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
//let a = [2,17,13,6,22,31,45,66,100,-18]
//1. перебрати його циклом while
/*
let i = 0
while (i < a.length){
    console.log(a[i]);
    i++
}*/
//-------------------------------------------------------------------------------------
//2. перебрати його циклом for
/*
for(let i = 0; i < a.length; i++)
{
    console.log(a[i]);
}

 */

//------------------------------------------------------------------------------------
//3. перебрати циклом while та вивести  числа тільки з непарним індексом
/*
let i = 0
while (i < a.length){
    if(i % 2 === 1){
    console.log(a[i]);
    }
    i++
}

 */
//-------------------------------------------------------------------------------------------
//4. перебрати циклом for та вивести  числа тільки з непарним індексом
/*
for (let i = 1; i < a.length; i+=2)
{
     console.log(a[i]);
}

 */
//----------------------------------------------------------------------------------------------
//5. перебрати циклом while та вивести  числа тільки парні  значення
/*
let i = 0
while (i < a.length){
    if(i % 2 === 0){
    console.log(a[i]);
    }
    i++
}

 */
//----------------------------------------------------------------------------------------
//6. перебрати циклом for та вивести  числа тільки парні  значення
/*
for (let i = 0; i < a.length; i+=2)
{
     console.log(a[i]);
}

 */
//---------------------------------------------------------------------------------------
//7. замінити кожне число кратне 3 на слово "okten"
/*
let i = 0
while (i < a.length){
    if(i % 3 === 0){
    a[i] = 'okten'
    }
    i++
}
console.log(a);

 */
//------------------------------------------------------------------------------------------
//8. вивести масив в зворотньому порядку.
/*
a.reverse()
console.log(a);

 */
//--------------------------------------------------------------------------------------------------
//9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
/*
let i = a.length-1
while (i >= 0){
    console.log(a[i]);
    i--
}
for(let i = a.length-1; i >= 0; i--)
{
    console.log(a[i]);
}*/

//-----------------------------------------------------------------------------------------------------------
//10 створити пустий масив та :
//- заповнити його 50 парними числами за допомоги циклу.
/*
let a = []
let i = 0;
let num =0;
while (i < 50)
{
    if(num %2 === 0){
        a[i] = num;
        i++
    }
    num++
}
console.log(a);

 */
//..........................................................................................................
//- заповнити його 50 непарними числами за допомоги циклу.
/*
let a = []
let i = 0;
let num =0;
while (i < 50)
{
    if(num % 2 !== 0){
        a[i] = num;
        i++
    }
    num++
}
console.log(a);

 */

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//1. Створити пустий масив та :
     //  a. заповнити його 50 парними числами за допомоги циклу.
/*
let a = []
let i = 0;
let num =0;
while (i < 50)
{
    if(num %2 === 0){
        a[i] = num;
        i++
    }
    num++
}
console.log(a);

 */
//..........................................................................................................
//- заповнити його 50 непарними числами за допомоги циклу.
/*
let a = []
let i = 0;
let num =0;
while (i < 50)
{
    if(num % 2 !== 0){
        a[i] = num;
        i++
    }
    num++
}
console.log(a);

 */
//------------------------------------------------------------------------------------------
//  c. Заповнити масив 20ма рандомними числами. (Google: Generate random number JS)
/*
let a = []
for (let i = 0; i < 20; i++)
{
    a[i] = Math.random();
}
console.log(a);

 */
//--------------------------------------------------------------------------------------------------

 //d. Заповнити масив 20ма рандомними чисалами в діапазоні від 8 до 732 (Google: Generate random number JS)
/*
let a = []
let c = 0,n = 0;
while(c < 20)
{
 n = Math.floor(Math.random() * 732);
    if(n >= 8){
        a[c] = n;
        c++
    }
}
console.log(a);

 */
///////////////////////////////////////////////////////
// 2. Вивести за допомогою console.log кожен третій елемен
/*
let a = [23, 54, 2, 13, 90, 43, 55, 89, 66, 10]
for (let i = 2; i < a.length; i+=3){
    console.log(a[i]);
}

 */
///////////////////////////////////////////////////////////////////////////
// 3. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним.
/*
let a = [23, 54, 2, 13, 90, 43, 55, 89, 66, 10]
for (let i = 2; i < a.length; i+=3){
    if(a[i] % 2 === 0)
    console.log(a[i]);
}

 */
//////////////////////////////////////////////////////////////////////////////////////
// 4. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним та записати їх в новий масив
/*
let a = [23, 54, 2, 13, 90, 43, 55, 89, 66, 10]
let b =[]
for (let i = 2; i < a.length; i+=3){
    if(a[i] % 2 === 0)
    b.push(a[i])
}
console.log(b);

 */
//////////////////////////////////////////////////////////////////////////////////////////////////
// 5. Вивести кожен елемент масиву, сусід справа якого є парним
//   EXAMPLE: [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ] -> Має бути виведено 1, 9, 56
/*
let a = [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ]
for (let i = 0; i < a.length + 1; i++){
    if(a[i+1] % 2 === 0)
        console.log(a[i]);
}

 */
//////////////////////////////////////////////////////////////////////////////////////////
//6. Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. Обрахувати середній чек.
/*
let a = [100,250,50,168,120,345,188]
let sum = 0;
for(let i = 0; i < a.length; i++){
    sum += a[i];
}
sum /= a.length
console.log(sum);

 */

////////////////////////////////////////////////////////////////////////////////////////////////
//7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
/*
let a = []
let b = []
for(let i = 0; i < 10; i++){
    a[i] = Math.floor(Math.random() * 100);
    b[i] = a[i] * 5
}
console.log(b);

 */
///////////////////////////////////////////////////////////////////////////////////////////
//8. Створити масив з будь якими значеннями (стрінги, числа, і тд...).
// пройтись по ньому, і якщо елемент є числом - додати його в інший масив.
/*
let arr = [true, false, null, 99999, 'Hi', undefined, 'q', 3.14, 2.7, 0]
b = []
for(let i = 0; i < arr.length; i++){
  if(typeof arr[i] === "number"){
      b.push(arr[i])
  }
}
console.log(b);*/
