//1) Створити масив з 20 чисел та:
//  a) відсортувати його від меншого до більшого.
//let arr = [90, 67, 8, 34, 78, 45, 2, 19, -1, 28, -12, 56, -89, 0, 67, 456, 34, 76, 1, -20]
/*arr.sort((a, b) => a - b)
console.log(arr);*/
//==============================================================================
//  b) відсортувати його від більшого до меншого.
/*
arr.sort((a, b) => b - a)
console.log(arr);

 */
//===================================================================================================
//  c) Відфілтрувати числа які є кратними 3.
/*
let arr1 = arr.filter((n) => n % 3 === 0)
console.log(arr1);

 */
//==========================================================================================
//  d) Відфілтрувати числа які є більшими за 10.
/*
let arr1 = arr.filter((n) => n > 10)
console.log(arr1);

 */
//========================================================================================
//  e) Проітерувати його forEach та вивести кожеш елмент за допомогою document.write
/*
arr.forEach((n) => document.write(n + '<br>'))

 */
//===================================================================================================
//  f) За допомогою map збільшити кожен елемент в масиві в три рази.
/*
let arr1 = arr.map(n => n*3)
console.log(arr1);

 */
//=========================================================================================================
//  g) Порахувати загальну суму всіх елментів у масиві (reduce)
/*
let sum = arr.reduce((acc, currentValue) => acc + currentValue)
console.log(sum);

 */
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
// 2) Створити масив з 20 стрічок та:
let str = ['Ukrain', 'Russia', 'Moldova', 'Hungry', 'Albania', 'USA', 'Canada', 'China', 'Egypt', 'Peru', 'Nepal', 'Latvia', 'Finland', 'Dania', 'Spain', 'France', 'Germany', 'Andora', 'Italia', 'Portugal']
//  a) Відсортувати його в алфавітному порядку
/*
console.log(str.sort());

 */
//======================================================================
//  b) Відсортувати в зворотньому порядку
/*
str1 = str.sort((a, b) => {
    if(b > a)
        return 1
    return -1
})
console.log(str1);

 */
//===============================================================================================
//  c) Отримати в новому масиві тільки ті слова, довжина яких більша за 4 букви (filter)
/*
let str1 = str.filter(a => a.length > 6)
console.log(str1);

 */
//==================================================================================
//  d) Змінити кожне слово в масиві додавши на початок 'Sam says *ваше слово*'
/*
let str1 = str.map(a => `Sam says ${a}`)
console.log(str1);

 */
//////////////////////////////////////////////////////////////////////////////////////////////
//
// 3) Все робити тільки за допомогою методів масивів!
// Дано масив :
let users = [
    {name: 'vasya', age: 31, isMarried: false},
    {name: 'petya', age: 30, isMarried: true},
    {name: 'kolya', age: 29, isMarried: true},
    {name: 'olya', age: 28, isMarried: false},
    {name: 'max', age: 30, isMarried: true},
    {name: 'anya', age: 31, isMarried: false},
    {name: 'oleg', age: 28, isMarried: true},
    {name: 'andrey', age: 29, isMarried: true},
    {name: 'masha', age: 39, isMarried: true},
    {name: 'olya', age: 32, isMarried: false},
    {name: 'max', age: 31, isMarried: true}
];
// a) відсортувати його за  віком (зростання , а потім окремо спадання)
/*
users.sort((a, b) => a.age - b.age)
users.sort((a,b)=>b.age - a.age)
console.log(users);

 */
//=============================================================================================================
// b) відсортувати його за кількістю знаків в імені  (зростання , а потім окремо спадання)
/*
users.sort((a, b)=> a.name.length - b.name.length)
users.sort((a, b)=> b.name.length - a.name.length)
console.log(users);

 */
//==================================================================================================================
// c) пройтись по ньому та додати кожному юзеру поле id - яке характеризує унікальний індентифікатор (По якому принципу його створювати - ваше рішення),
//    та зберегти це в новий масив (первинний масив залишиться без змін)
// d) відсортувати його за індентифікатором


//let newArray = users.map((user)=> {user.id = user.age * user.name.length + user.isMarried; return user})
/*newArray.sort((a, b)=> a.id - b.id)
console.log(newArray);

 */
//=====================================================================================
// e) Всі хто одружений мають попасти у новий масив та отрмати квартиру (reduce)
users.reduce((acc, m) => {

    if(m.isMarried) {
        m.isHouse = true

    }
}, 0)
let arr = users.filter(m => (m.isHouse === true))
console.log(arr);